start=str(input("พิมพ์ว่า กินไรดี เพื่อเริ่มโปรแกรม:"))
while (start=="กินไรดี"):
    count=0
    food=["ข้าวมันไก่","ผัดกะเพราไข่ดาว","ข้าวผัด","ชาบู","ลาบหมู","ส้มตำ","ไก่ย่าง","ซูชิ","ราเมง","ข้าวหมูแดง","ผักขมอบชีส","ไก่ทอด","หมูทอด","สเต็ก","สลัด","ข้าวหน้าเนื้อ"]
    print("------loading--------")
    print("-----ยินดีตอนรับเข้าสู่------")
    print("*****แอพกินอะไรดี?*******")
    Answer1=str(input("ตอนนี้คุณหิวแล้วหรือยัง? ตอบ หิว หรือ ไม่หิว:"))
    if (Answer1=="ไม่หิว"):
        print("ไว้เรียกใช้ฉันได้เมื่อคุณหิว")
    if (Answer1=="หิว"):
        import random
        Answerfood=random.choice(food)
        print(Answerfood)
        Answer2=str(input("ใช่สิ่งที่คุณอยากกินไหม? ตอบ ใช่ หรือ ไม่ :"))
    if (Answer2=="ใช่"):
        print("ขอให้รับประทานอาหารให้อร่อย")
    while (Answer2=="ไม่"):
        count+=1
        if count==3:
            tabetai=(input("งั้นมีสิ่งที่อยากกินเป็นพิเศษมั้ย? :"))
            food.append(tabetai)
            print("เราจะจำเมนูนั้นเอาไว้ ขอให้รับประทานอาหารให้อร่อย...")
            break
        else:
            import random
            Answerfood=random.choice(food)
            print(Answerfood)
            Answer3=str(input("ใช่สิ่งที่คุณอยากกินไหม? ตอบ ใช่ หรือ ไม่ :"))
        if (Answer3=="ใช่"):
            print("ขอให้รับประทานอาหารให้อร่อย")
            break
    start=0
    start=str(input("คุณสามารถเรียกใช้โปรแกรมได้อีกแค่พิมพ์ว่า กินไรดี เพื่อเรียกใช้โปรแกรม:"))